-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2021 年 07 月 14 日 20:18
-- 伺服器版本： 10.4.19-MariaDB
-- PHP 版本： 7.4.19

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `lunar_phase`
--

-- --------------------------------------------------------

--
-- 資料表結構 `items`
--

CREATE TABLE `items` (
  `itemId` int(11) NOT NULL COMMENT '商品流水號',
  `itemNo` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '商品品號',
  `itemName` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '商品名稱',
  `itemCoverImg` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品封面路徑',
  `itemImg` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品組圖路徑',
  `itemPrice` int(11) NOT NULL COMMENT '商品價格',
  `itemQty` tinyint(3) NOT NULL COMMENT '商品數量',
  `itemDescription` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '商品描述',
  `itemCategoryId` int(11) NOT NULL COMMENT '商品子層分類編號',
  `itemCategoryParentId` int(11) NOT NULL COMMENT '商品父層分類編號',
  `itemFlowId` int(11) NOT NULL COMMENT '商品適用流量編號',
  `itemSize` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '商品尺寸',
  `itemOptionId` int(11) DEFAULT NULL COMMENT '商品規格編號',
  `itemTagId` int(11) DEFAULT NULL COMMENT '商品標籤編號',
  `itemRanking` int(11) DEFAULT NULL COMMENT '商品評價',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '建立時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `items`
--

INSERT INTO `items` (`itemId`, `itemNo`, `itemName`, `itemCoverImg`, `itemImg`, `itemPrice`, `itemQty`, `itemDescription`, `itemCategoryId`, `itemCategoryParentId`, `itemFlowId`, `itemSize`, `itemOptionId`, `itemTagId`, `itemRanking`, `created_at`, `updated_at`) VALUES
(2, 'NP0101', '弦月柔棉 日用薄型衛生棉', 'pd01-00.jpg', 'pd01-01.jpg,pd01-02.jpg,pd01-03.jpg', 100, 99, '親膚少刺激<br/>嚴選天然無漂白素材<br/>6大無添加<br/>新升級波紋瞬潔層', 7, 1, 3, '23cm', 1, 1, 0, '2021-07-14 15:08:18', '2021-07-14 15:08:18'),
(3, 'NP0102', '弦月柔棉 日用薄型衛生棉', 'pd01-00.jpg', 'pd01-01.jpg,pd01-02.jpg,pd01-03.jpg', 80, 99, '親膚少刺激<br/>\r\n嚴選天然無漂白素材<br/>\r\n6大無添加<br/>\r\n新升級波紋瞬潔層', 7, 1, 3, '23cm', 2, 1, 0, '2021-07-14 15:08:20', '2021-07-14 15:08:20'),
(4, 'NP0103', '弦月柔棉 日用薄型衛生棉', 'pd01-00.jpg', 'pd01-01.jpg,pd01-02.jpg,pd01-03.jpg', 90, 99, '親膚少刺激<br/>\r\n嚴選天然無漂白素材<br/>\r\n6大無添加<br/>\r\n新升級波紋瞬潔層', 7, 1, 3, '23cm', 3, 1, 0, '2021-07-14 15:08:22', '2021-07-14 15:08:22'),
(5, 'NP0201', '弦月柔棉 日用量多衛生棉', 'pd02-00.jpg', 'pd01-01.jpg,pd01-02.jpg,pd01-03.jpg', 100, 99, '親膚少刺激<br/>\r\n嚴選天然無漂白素材<br/>\r\n6大無添加<br/>\r\n新升級波紋瞬潔層', 7, 1, 4, '26cm', 4, 1, 5, '2021-07-14 15:08:25', '2021-07-14 15:08:25'),
(6, 'NP0202', '弦月柔棉 日用量多衛生棉', 'pd02-00.jpg', 'pd01-01.jpg,pd01-02.jpg,pd01-03.jpg', 80, 99, '親膚少刺激<br/>\r\n嚴選天然無漂白素材<br/>\r\n6大無添加<br/>\r\n新升級波紋瞬潔層', 7, 1, 4, '26cm', 5, 1, 0, '2021-07-14 15:08:27', '2021-07-14 15:08:27'),
(7, 'NP0301', '滿月柔棉 夜用薄型衛生棉', 'pd03-00.jpg', 'pd03-01.jpg,pd03-02.jpg,pd03-03.jpg', 100, 99, '親膚少刺激<br/>\r\n嚴選天然無漂白素材<br/>\r\n6大無添加<br/>\r\n新升級波紋瞬潔層', 8, 1, 4, '29cm', 6, 1, 0, '2021-07-14 17:53:57', '2021-07-14 17:53:57'),
(8, 'NP0302', '滿月柔棉 夜用薄型衛生棉', 'pd03-00.jpg', 'pd03-01.jpg,pd03-02.jpg,pd03-03.jpg', 80, 99, '親膚少刺激<br/>\r\n嚴選天然無漂白素材<br/>\r\n6大無添加<br/>\r\n新升級波紋瞬潔層', 8, 1, 4, '29cm', 7, 1, 0, '2021-07-14 15:08:32', '2021-07-14 15:08:32'),
(9, 'NP0401', '滿月柔棉 夜用加長衛生棉', 'pd04-00.jpg', 'pd03-01.jpg,pd03-02.jpg,pd03-03.jpg', 120, 99, '親膚少刺激<br/>\r\n嚴選天然無漂白素材<br/>\r\n6大無添加<br/>\r\n新升級波紋瞬潔層', 8, 1, 5, '36cm', 8, 1, 0, '2021-07-14 15:08:33', '2021-07-14 15:08:33'),
(10, 'NP0402', '滿月柔棉 夜用加長衛生棉', 'pd04-00.jpg', 'pd03-01.jpg,pd03-02.jpg,pd03-03.jpg', 90, 99, '親膚少刺激<br/>\r\n嚴選天然無漂白素材<br/>\r\n6大無添加<br/>\r\n新升級波紋瞬潔層', 8, 1, 5, '36cm', 9, 1, 0, '2021-07-14 15:08:35', '2021-07-14 15:08:35'),
(11, 'NP0501', '弦月柔棉 量少型衛生棉', 'pd05-00.jpg', 'pd01-01.jpg,pd01-02.jpg,pd01-03.jpg', 80, 99, '親膚少刺激<br/>\r\n嚴選天然無漂白素材<br/>\r\n6大無添加<br/>\r\n新升級波紋瞬潔層', 7, 1, 2, '17cm', 10, 1, 0, '2021-07-14 15:08:41', '2021-07-14 15:08:41'),
(12, 'NP0502', '弦月柔棉 量少型衛生棉', 'pd05-00.jpg', 'pd01-01.jpg,pd01-02.jpg,pd01-03.jpg', 70, 99, '親膚少刺激<br/>\r\n嚴選天然無漂白素材<br/>\r\n6大無添加<br/>\r\n新升級波紋瞬潔層', 7, 1, 2, '17cm', 11, 1, 0, '2021-07-14 15:08:42', '2021-07-14 15:08:42'),
(13, 'NP0601', '朔月柔棉 超薄護墊', 'pd06-00.jpg', 'pd06-01.jpg,pd06-02.jpg,pd06-03.jpg', 120, 60, '親膚少刺激<br/>\r\n嚴選天然無漂白素材<br/>\r\n6大無添加<br/>\r\n新升級波紋瞬潔層', 9, 1, 1, '14cm', 12, 1, 3, '2021-07-14 17:52:21', '2021-07-14 17:52:21'),
(14, 'NP0602', '朔月柔棉 超薄護墊', 'pd06-00.jpg', 'pd06-01.jpg,pd06-02.jpg,pd06-03.jpg', 60, 99, '親膚少刺激<br/>\r\n嚴選天然無漂白素材<br/>\r\n6大無添加<br/>\r\n新升級波紋瞬潔層', 9, 1, 1, '14cm', 13, 1, 0, '2021-07-14 15:08:45', '2021-07-14 15:08:45'),
(15, 'TP0101', '新月衛生棉條 一般型', 'tp01-00.jpg', 'tp01-01.jpg,tp01-02.jpg,tp01-03.jpg', 150, 99, '專為好動女孩設計<br/>\r\n8道瞬吸溝槽<br/>\r\n一體成型吸收體<br/>\r\n穩穩接住瞬間大流量', 10, 2, 3, '導管', 14, 1, 5, '2021-07-14 15:08:55', '2021-07-14 15:08:55'),
(16, 'TP0102', '新月衛生棉條 一般型', 'tp02-00.jpg', 'tp02-01.jpg,tp02-02.jpg,tp02-03.jpg', 250, 99, '專為好動女孩設計<br/>\r\n8道瞬吸溝槽<br/>\r\n一體成型吸收體<br/>\r\n穩穩接住瞬間大流量', 10, 2, 3, '指入', 15, 1, 0, '2021-07-14 15:08:56', '2021-07-14 15:08:56'),
(17, 'TP0201', '新月衛生棉條 量少型', 'tp03-00.jpg', 'tp01-01.jpg,tp01-02.jpg,tp01-03.jpg', 150, 99, '專為好動女孩設計<br/>\r\n8道瞬吸溝槽<br/>\r\n一體成型吸收體<br/>\r\n穩穩接住瞬間大流量', 11, 2, 2, '導管', 14, 1, 0, '2021-07-14 15:08:58', '2021-07-14 15:08:58'),
(18, 'TP0202', '新月衛生棉條 量少型', 'tp04-00.jpg', 'tp02-01.jpg,tp02-02.jpg,tp02-03.jpg', 250, 99, '專為好動女孩設計<br/>\r\n8道瞬吸溝槽<br/>\r\n一體成型吸收體<br/>\r\n穩穩接住瞬間大流量', 11, 2, 2, '指入', 15, 1, 0, '2021-07-14 15:09:01', '2021-07-14 15:09:01'),
(19, 'TP0301', '新月衛生棉條 量多型', 'tp05-00.jpg', 'tp01-01.jpg,tp01-02.jpg,tp01-03.jpg', 120, 99, '專為好動女孩設計<br/>\r\n8道瞬吸溝槽<br/>\r\n一體成型吸收體<br/>\r\n穩穩接住瞬間大流量', 12, 2, 4, '導管', 16, 1, 0, '2021-07-14 15:09:04', '2021-07-14 15:09:04'),
(20, 'TP0302', '新月衛生棉條 量多型', 'tp06-00.jpg', 'tp02-01.jpg,tp02-02.jpg,tp02-03.jpg', 220, 99, '專為好動女孩設計<br/>\r\n8道瞬吸溝槽<br/>\r\n一體成型吸收體<br/>\r\n穩穩接住瞬間大流量', 12, 2, 4, '指入', 17, 1, 0, '2021-07-14 15:09:06', '2021-07-14 15:09:06'),
(21, 'CP0101', '弧月布衛生棉 日用一般', 'cp0101-00.jpg', 'cp0101-01.jpg,cp0101-02.jpg', 500, 99, '五層有機純棉吸收層<br/>\r\n無漂白、無染色、不含螢光劑<br/>\r\n親膚透氣，減少肌膚負擔<br/>\r\n可重複使用，環保減塑愛地球', 13, 3, 3, '23cm', 18, 1, 3, '2021-07-14 17:52:38', '2021-07-14 17:52:38'),
(22, 'CP0102', '弧月布衛生棉 日用一般', 'cp0101-00.jpg', 'cp0101-01.jpg,cp0101-02.jpg', 500, 99, '五層有機純棉吸收層<br/>\r\n無漂白、無染色、不含螢光劑<br/>\r\n親膚透氣，減少肌膚負擔<br/>\r\n可重複使用，環保減塑愛地球', 13, 3, 3, '23cm', 19, 1, 0, '2021-07-14 15:09:24', '2021-07-14 15:09:24'),
(23, 'CP0103', '弧月布衛生棉 日用一般 優惠組', 'cp0101-00.jpg', 'cp0101-01.jpg,cp0101-02.jpg', 900, 99, '五層有機純棉吸收層<br/>\r\n無漂白、無染色、不含螢光劑<br/>\r\n親膚透氣，減少肌膚負擔<br/>\r\n可重複使用，環保減塑愛地球', 13, 3, 3, '23cm', 20, 1, 0, '2021-07-14 15:09:27', '2021-07-14 15:09:27'),
(24, 'CP0201', '弧月布衛生棉 日用量多', 'cp0201-00.jpg', 'cp0101-01.jpg,cp0101-02.jpg', 600, 99, '五層有機純棉吸收層<br/>\r\n無漂白、無染色、不含螢光劑<br/>\r\n親膚透氣，減少肌膚負擔<br/>\r\n可重複使用，環保減塑愛地球', 13, 3, 4, '26cm', 18, 1, 0, '2021-07-14 15:09:28', '2021-07-14 15:09:28'),
(25, 'CP0202', '弧月布衛生棉 日用量多', 'cp0201-00.jpg', 'cp0101-01.jpg,cp0101-02.jpg', 600, 99, '五層有機純棉吸收層<br/>\r\n無漂白、無染色、不含螢光劑<br/>\r\n親膚透氣，減少肌膚負擔<br/>\r\n可重複使用，環保減塑愛地球', 13, 3, 4, '26cm', 19, 1, 0, '2021-07-14 15:09:30', '2021-07-14 15:09:30'),
(26, 'CP0203', '弧月布衛生棉 日用量多 優惠組', 'cp0201-00.jpg', 'cp0101-01.jpg,cp0101-02.jpg', 1100, 99, '五層有機純棉吸收層<br/>\r\n無漂白、無染色、不含螢光劑<br/>\r\n親膚透氣，減少肌膚負擔<br/>\r\n可重複使用，環保減塑愛地球', 13, 3, 4, '26cm', 20, 1, 0, '2021-07-14 15:09:33', '2021-07-14 15:09:33'),
(27, 'CP0301', '弧月布衛生棉 夜用加長', 'cp0301-00.jpg', 'cp0101-01.jpg,cp0101-02.jpg', 800, 99, '五層有機純棉吸收層<br/>\r\n無漂白、無染色、不含螢光劑<br/>\r\n親膚透氣，減少肌膚負擔<br/>\r\n可重複使用，環保減塑愛地球', 13, 3, 5, '29cm', 18, 1, 0, '2021-07-14 15:09:57', '2021-07-14 15:09:57'),
(28, 'CP0302', '弧月布衛生棉 夜用加長', 'cp0301-00.jpg', 'cp0101-01.jpg,cp0101-02.jpg', 800, 99, '五層有機純棉吸收層<br/>\r\n無漂白、無染色、不含螢光劑<br/>\r\n親膚透氣，減少肌膚負擔<br/>\r\n可重複使用，環保減塑愛地球', 13, 3, 5, '29cm', 19, 1, 0, '2021-07-14 15:10:00', '2021-07-14 15:10:00'),
(29, 'CP0303', '弧月布衛生棉 夜用加長 優惠組', 'cp0301-00.jpg', 'cp0101-01.jpg,cp0101-02.jpg', 1500, 99, '五層有機純棉吸收層<br/>\r\n無漂白、無染色、不含螢光劑<br/>\r\n親膚透氣，減少肌膚負擔<br/>\r\n可重複使用，環保減塑愛地球', 13, 3, 5, '29cm', 20, 1, 0, '2021-07-14 15:10:02', '2021-07-14 15:10:02'),
(30, 'MC0101', '盈月杯 教學', 'mc01-00.jpg', 'mc01-01.jpg,mc01-02.jpg', 1000, 99, '針對亞洲女性設計尺寸<br/>\r\n100%醫療級矽膠<br/>\r\n輕鬆適應各種活動，不易外漏<br/>\r\n可重複使用，環保愛地球', 15, 4, 2, '18ml', 21, 1, 5, '2021-07-14 15:10:05', '2021-07-14 15:10:05'),
(31, 'MC0201', '盈月杯 標準', 'mc02-00.jpg', 'mc01-01.jpg,mc01-02.jpg', 1200, 99, '針對亞洲女性設計尺寸<br/>\r\n100%醫療級矽膠<br/>\r\n輕鬆適應各種活動，不易外漏<br/>\r\n可重複使用，環保愛地球', 16, 4, 3, '23ml', 21, 1, 0, '2021-07-14 15:10:07', '2021-07-14 15:10:07'),
(32, 'MC0301', '盈月杯 滿月', 'mc03-00.jpg', 'mc01-01.jpg,mc01-02.jpg', 1200, 99, '針對亞洲女性設計尺寸<br/>\r\n100%醫療級矽膠<br/>\r\n輕鬆適應各種活動，不易外漏<br/>\r\n可重複使用，環保愛地球', 17, 4, 4, '30ml', 21, 1, 0, '2021-07-14 15:10:17', '2021-07-14 15:10:17'),
(33, 'PT0101', '月暈小褲 舒適', 'pt01-00.jpg', 'pt01-01.jpg,pt01-02.jpg,pt01-03.jpg', 880, 99, '取代衛生棉，告別濕悶感<br/>\r\n輕薄柔軟的機能材質<br/>\r\n適用洗衣機清洗<br/>\r\n可重複使用，環保愛地球', 18, 5, 3, 'S/M/L', 22, 1, 3, '2021-07-14 17:54:18', '2021-07-14 17:54:18'),
(34, 'PT0102', '月暈小褲 舒適', 'pt01-00.jpg', 'pt01-01.jpg,pt01-02.jpg,pt01-03.jpg', 880, 99, '取代衛生棉，告別濕悶感<br/>\r\n輕薄柔軟的機能材質<br/>\r\n適用洗衣機清洗<br/>\r\n可重複使用，環保愛地球', 18, 5, 3, 'S/M/L', 23, 1, 0, '2021-07-14 15:10:22', '2021-07-14 15:10:22'),
(35, 'PT0103', '月暈小褲 舒適', 'pt01-00.jpg', 'pt01-01.jpg,pt01-02.jpg,pt01-03.jpg', 880, 99, '取代衛生棉，告別濕悶感<br/>\r\n輕薄柔軟的機能材質<br/>\r\n適用洗衣機清洗<br/>\r\n可重複使用，環保愛地球', 18, 5, 3, 'S/M/L', 24, 1, 0, '2021-07-14 15:10:23', '2021-07-14 15:10:23'),
(36, 'PT0201', '月暈小褲 無痕', 'pt02-00.jpg', 'pt02-01.jpg,pt02-02.jpg,pt02-03.jpg', 980, 99, '取代衛生棉，告別濕悶感<br/>\r\n輕薄柔軟的機能材質<br/>\r\n適用洗衣機清洗<br/>\r\n可重複使用，環保愛地球', 18, 5, 3, 'S/M/L', 22, 1, 0, '2021-07-14 15:10:25', '2021-07-14 15:10:25'),
(37, 'PT0202', '月暈小褲 無痕', 'pt02-00.jpg', 'pt02-01.jpg,pt02-02.jpg,pt02-03.jpg', 980, 99, '取代衛生棉，告別濕悶感<br/>\r\n輕薄柔軟的機能材質<br/>\r\n適用洗衣機清洗<br/>\r\n可重複使用，環保愛地球', 18, 5, 3, 'S/M/L', 23, 1, 0, '2021-07-14 15:10:28', '2021-07-14 15:10:28'),
(38, 'PT0203', '月暈小褲 無痕', 'pt02-00.jpg', 'pt02-01.jpg,pt02-02.jpg,pt02-03.jpg', 980, 99, '取代衛生棉，告別濕悶感<br/>\r\n輕薄柔軟的機能材質<br/>\r\n適用洗衣機清洗<br/>\r\n可重複使用，環保愛地球', 18, 5, 3, 'S/M/L', 24, 1, 0, '2021-07-14 15:10:30', '2021-07-14 15:10:30'),
(39, 'PT0301', '月暈小褲 優雅', 'pt03-00.jpg', 'pt03-01.jpg,pt03-02.jpg,pt03-03.jpg', 1280, 99, '取代衛生棉，告別濕悶感<br/>\r\n輕薄柔軟的機能材質<br/>\r\n適用洗衣機清洗<br/>\r\n可重複使用，環保愛地球', 18, 5, 3, 'S/M/L', 22, 1, 0, '2021-07-14 15:10:32', '2021-07-14 15:10:32'),
(40, 'PT0302', '月暈小褲 優雅', 'pt03-00.jpg', 'pt03-01.jpg,pt03-02.jpg', 1280, 99, '取代衛生棉，告別濕悶感<br/>\r\n輕薄柔軟的機能材質<br/>\r\n適用洗衣機清洗<br/>\r\n可重複使用，環保愛地球', 18, 5, 3, 'S/M/L', 23, 1, 0, '2021-07-14 15:10:33', '2021-07-14 15:10:33'),
(41, 'PT0303', '月暈小褲 優雅', 'pt03-00.jpg', 'pt03-01.jpg,pt03-02.jpg', 1280, 99, '取代衛生棉，告別濕悶感<br/>\r\n輕薄柔軟的機能材質<br/>\r\n適用洗衣機清洗<br/>\r\n可重複使用，環保愛地球', 18, 5, 3, 'S/M/L', 24, 1, 0, '2021-07-14 15:10:36', '2021-07-14 15:10:36'),
(42, 'PT0401', '月暈小褲 舒適 加強型', 'pt04-00.jpg', 'pt04-01.jpg,pt04-02.jpg,pt04-03.jpg', 1080, 99, '取代衛生棉，告別濕悶感<br/>\r\n輕薄柔軟的機能材質<br/>\r\n適用洗衣機清洗<br/>\r\n可重複使用，環保愛地球', 19, 5, 4, 'S/M/L', 22, 1, 0, '2021-07-14 15:10:37', '2021-07-14 15:10:37'),
(43, 'PT0402', '月暈小褲 舒適 加強型', 'pt04-00.jpg', 'pt04-01.jpg,pt04-02.jpg,pt04-03.jpg', 1080, 99, '取代衛生棉，告別濕悶感<br/>\r\n輕薄柔軟的機能材質<br/>\r\n適用洗衣機清洗<br/>\r\n可重複使用，環保愛地球', 19, 5, 4, 'S/M/L', 23, 1, 0, '2021-07-14 15:10:39', '2021-07-14 15:10:39'),
(44, 'PT0403', '月暈小褲 舒適 加強型', 'pt04-00.jpg', 'pt04-01.jpg,pt04-02.jpg,pt04-03.jpg', 1080, 99, '取代衛生棉，告別濕悶感<br/>\r\n輕薄柔軟的機能材質<br/>\r\n適用洗衣機清洗<br/>\r\n可重複使用，環保愛地球', 19, 5, 4, 'S/M/L', 24, 1, 0, '2021-07-14 15:10:42', '2021-07-14 15:10:42');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `items`
--
ALTER TABLE `items`
  ADD PRIMARY KEY (`itemId`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `items`
--
ALTER TABLE `items`
  MODIFY `itemId` int(11) NOT NULL AUTO_INCREMENT COMMENT '商品流水號', AUTO_INCREMENT=45;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
